
                            &НаКлиенте
Процедура BKM_ВидДоговораПриИзменении(Элемент) // Оставь то, что написала 1С!
    BKM_УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура BKM_УправлениеВидимостью()
    // Проверяем условие
    ЭтоАбонент = (Объект.BKM_ВидДоговор = Перечисления.BKM_ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание);
    
    // Твое исправленное имя элемента
    Элементы.BKM_АбонПлатаМесяц.Видимость = ЭтоАбонент;
    
    // Чтобы наверняка сработало прямо сейчас
    ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры