Процедура ВКМ_ПриЗаполненииПрофилейГруппДоступа(ОписаниеПрофилей) Экспорт

    // Профиль: Диспетчер заявок
    Профиль = ОписаниеПрофилей.Добавить();
    Профиль.Идентификатор = "ВКМ_ДиспетчерЗаявок";
    Профиль.Наименование  = "Диспетчер заявок";
    Профиль.Роли = Новый Массив; 
    Профиль.Роли.Добавить("ВКМ_ДиспетчерЗаявок");

Профиль = ОписаниеПрофилей.Добавить();
    Профиль.Идентификатор = " ВКМ_Инженер ";
    Профиль.Наименование  = "Инженер ";
    Профиль.Роли = Новый Массив; 
    Профиль.Роли.Добавить("ВКМ_Инженер ");

Профиль = ОписаниеПрофилей.Добавить();
    Профиль.Идентификатор = " ВКМ_Руководитель ";
    Профиль.Наименование  = " Руководитель ";
    Профиль.Роли = Новый Массив; 
    Профиль.Роли.Добавить("ВКМ_Руководитель ");

КонецПроцедуры
