#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // если не нужен — удалить
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВКМ_ВРаботу(Команда)
    ВКМ_СменитьСтатусНаСервере("ВРаботе");
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_Выполнена(Команда)
    ВКМ_СменитьСтатусНаСервере("Выполнена");
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_СменитьСтатусНаСервере(НовыйСтатус)
    // серверная логика
КонецПроцедуры
#КонецОбласти
&НаКлиенте
Процедура ВКМ_ИсторияСтатусов(Команда)

	Если Объект.Ссылка = Неопределено Или Объект.ЭтоНовый() Тогда
		Сообщить("Сначала запишите заявку.");
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ВКМ_Заявка", Объект.Ссылка));

	ОткрытьФорму("РегистрСведений.ВКМ_ИсторияСтатусовЗаявок.ФормаСписка", ПараметрыФормы);

КонецПроцедуры
